cask_args appdir: "/Applications"

tap "dart-lang/dart"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "noahgorstein/tap"
tap "qmk/qmk"
tap "rinchsan/tap"
tap "Songmu/tap"

brew "alacritty"
brew "avrdude"
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "choose-rust"
brew "circleci"
brew "colordiff"
brew "coreutils"
brew "dart"
brew "deno"
brew "docker-clean"
brew "exa"
brew "fd"
brew "fish"
brew "font-hackgen-nerd"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gocredits"
brew "golangci-lint"
brew "golang-migrate"
brew "gosimports"
brew "graphviz"
brew "gron"
brew "helm"
brew "hugo"
brew "imgcat"
brew "jq"
brew "jqp"
brew "kubernetes-cli"
brew "mas"
brew "mysql"
brew "nano"
brew "nkf"
brew "node"
brew "nodenv"
brew "pango"
brew "peco"
brew "protobuf"
brew "pyenv"
brew "qmk"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "sqlmap"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "wget"
brew "weaveworks/tap/eksctl"
brew "yarn"

cask "cmd-eikana"
cask "discord"
cask "docker"
cask "figma"
cask "goland"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "kindle"
cask "nosql-workbench"
cask "notion"
cask "postman"
cask "pycharm-ce"
cask "raycast"
cask "session-manager-plugin"
cask "shottr"
cask "stoplight-studio"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"

mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
