cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "qmk/qmk"
tap "rinchsan/tap"

brew "ansible"
brew "awscli"
brew "bat"
brew "choose-rust"
brew "circleci"
brew "coreutils"
brew "docker-clean"
brew "exa"
brew "fd"
brew "fish"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "golangci-lint"
brew "gosimports"
brew "graphviz"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "mysql"
brew "nano"
brew "nkf"
brew "node"
brew "nodenv"
brew "pango"
brew "peco"
brew "protobuf"
brew "pyenv"
brew "qmk"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "wget"
brew "weaveworks/tap/eksctl"
brew "yarn"

cask "alfred"
cask "clipy"
cask "cmd-eikana"
cask "discord"
cask "docker"
cask "goland"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "notion"
cask "pycharm-ce"
cask "the-unarchiver"
cask "zoom"

mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
