cask_args appdir: "/Applications"

tap "dart-lang/dart"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "noahgorstein/tap"
tap "qmk/qmk"
tap "rinchsan/tap"
tap "Songmu/tap"

brew "alp"
brew "ansible"
brew "asdf"
brew "avrdude"
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "choose-rust"
brew "circleci"
brew "colordiff"
brew "coreutils"
brew "dart"
brew "deno"
brew "docker-clean"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gocredits"
brew "gosimports"
brew "graphviz"
brew "gron"
brew "helm"
brew "hugo"
brew "imagemagick"
brew "imgcat"
brew "jq"
brew "jqp"
brew "kubernetes-cli"
brew "mas"
brew "mysql"
brew "neovim"
brew "nkf"
brew "node"
brew "pango"
brew "percona-toolkit"
brew "pinact"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "qmk"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "shellcheck"
brew "sqlmap"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "wget"
brew "weaveworks/tap/eksctl"
brew "yarn"

cask "1password"
cask "alacritty"
cask "bitwarden"
cask "cursor"
cask "discord"
cask "docker"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "google-japanese-ime"
cask "kindle"
cask "notion"
cask "postman"
cask "raycast"
cask "session-manager-plugin"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "xcodes"
cask "zoom"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
